Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you can't modify the dependency, you can still index it by adding `quarkus.index-dependency` entries to your `application.properties`:
ja_jp: 依存関係を変更できなくても、 `quarkus.index-dependency` エントリーを `application.properties` に追加することでインデックスを作成できます。

source: If you cannot install GraalVM, you can use a multi-stage Docker build to run Maven inside a Docker container that embeds GraalVM. There is an explanation of how to do this at <<#multistage-docker,the end of this guide>>.
ja_jp: GraalVM をインストールできない場合は、マルチステージの Docker ビルドを使用して、GraalVM が組み込まれた Docker コンテナー内で Maven を実行できます。 これを行う方法については、<<#multistage-docker,the end of this guide>> で説明しています。

source: If you cannot install GraalVM, you can use a multi-stage Docker build to run Maven inside a Docker container that embeds GraalVM. There is an explanation of how to do this at the end of this guide.
ja_jp: GraalVMをインストールできない場合は、マルチステージのDockerビルドを使用して、GraalVMを含むDockerコンテナー内でMavenを実行することができます。このガイドの最後にこれを行う方法の説明があります。

source: If you change it to a synchronous signature, it runs on a worker thread:
ja_jp: これを同期シグネチャに変更すると、ワーカースレッドで実行されます。

source: If you change the configuration properties of an extension, rebuild that extension first (to regenerate the associated config docs in `target/asciidoc/generated/config/`), and then rebuild the `docs` module.
ja_jp: エクステンションの設定プロパティーを変更した場合には、最初にそのエクステンションをリビルドし (関連する設定ドキュメントを `target/asciidoc/generated/config/` に再作成して)、 `docs` モジュールをリビルドしてください。

source: If you change the protocol, you also need to change the port in the endpoint. The default port for `grpc` is `4317` and for `http/protobuf` is `4318`.
ja_jp: プロトコルを変更する場合は、エンドポイントのポートも変更する必要があります。 `grpc` のデフォルトポートは `4317` で、 `http/protobuf` のデフォルトポートは `4318` です。

source: If you check carefully the native executable build options, you can see that the SSL related options are gone:
ja_jp: ネイティブ実行可能ファイルのビルドオプションをよく確認してみると、SSL関連のオプションがなくなっているのがわかります。

source: If you choose to use an alias for the `quarkus` command, adjust the command completion with the following commands:
ja_jp: `quarkus` コマンドにエイリアスを使用する場合は、以下のコマンドでコマンド補完を調整します。

source: If you choose to use an alias for the quarkus command, adjust command completion with the following commands:
ja_jp: quarkusコマンドにエイリアスを使用する場合は、以下のコマンドでコマンド補完を調整します:

source: If you choose to use standard POM elements then your `pom.xml` must contain these entries at the very least, of course adapting values to your own:
ja_jp: 標準の POM 要素を使用することを選択した場合、 `pom.xml` には少なくともこれらのエントリーが含まれている必要があります。もちろん、値を独自のものに適合させます。

source: If you click the Run icon, it will start the Quarkus application in dev mode. If you click the Debug button, it will start the Quarkus application in dev mode and connect a local Java debugger to the running application.
ja_jp: 実行アイコンをクリックすると、Quarkusアプリケーションが開発モードで起動します。デバッグボタンをクリックすると、Quarkusアプリケーションが開発モードで起動し、実行中のアプリケーションにローカルのJavaデバッガが接続されます。

source: If you combine HTTP and Kafka (using reactive messaging), you will use an emitter. Depending on the emitter type (`Emitter` or `MutinyEmitter`), the `send` method returns a `CompletionStage` or a `Uni`. So, the following HTTP method runs on the I/O thread:
ja_jp: HTTPとKafkaを組み合わせる場合（リアクティブメッセージングを使用する場合）は、エミッターを使用します。エミッターのタイプ（ `Emitter` または `MutinyEmitter` ）に応じて、 `send` メソッドは `CompletionStage` または `Uni` を返します。そのため、以下のHTTPメソッドはI/Oスレッドで実行されます。

source: If you configure Quarkus to use the same port for both HTTP and gRPC servers with the property `quarkus.grpc.server.use-separate-server=false`, then you don't need to change the default `target-port`.
ja_jp: プロパティー `quarkus.grpc.server.use-separate-server=false` を使用して、HTTP サーバーと gRPC サーバーの両方に同じポートを使用するように Quarkus を設定する場合は、デフォルトの `target-port` を変更する必要はありません。

source: If you configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Wiremock` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: もし、 `mp.jwt.verify.publickey.location` が HTTPS または HTTP ベースの JsonWebKey (JWK) セットを指すように設定している場合は、 xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token結合テスト] `Wiremock` のセクションで説明したのと同じアプローチが使えますが、代わりに MP JWT 設定プロパティを使うように `application.properties` を変更するだけです：

source: If you configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Wiremock` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: HTTPS または HTTP ベースの JsonWebKey (JWK) セットを指すように `mp.jwt.verify.publickey.location` を設定する場合は、xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer トークン統合テスト] の `Wiremock` セクションで説明したのと同じアプローチを使用できますが、その場合は代わりに MPJWT 設定プロパティーを使用するように `application.properties` を変更します。

source: If you configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP-based JsonWebKey (JWK) set, then you can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] `Wiremock` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: `mp.jwt.verify.publickey.location` を HTTPS または HTTP ベースの JsonWebKey (JWK) セットを指すように設定する場合は、xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] `Wiremock` セクションで説明されているのと同じアプローチを使用できますが、代わりに MP JWT 設定プロパティーを使用するように `application.properties` のみを変更します。

source: If you configure the log format with the following line:
ja_jp: 以下の行でログフォーマットを設定した場合:

source: If you configured a _named_ Redis client, you need to use the `io.quarkus.redis.RedisClientName` qualifier to select the right client:
ja_jp: _名前付きの_ Redis クライアントを設定した場合、 `io.quarkus.redis.RedisClientName` 修飾子を使用して、正しいクライアントを選択する必要があります。

source: If you configured the _default_ Redis client, you could inject the data sources using:
ja_jp: _デフォルトの_ Redis クライアントを設定した場合、以下を使用してデータソースを注入することができます。

source: If you correctly followed the xref:building-native-image.adoc[building native image guide], you should have a local container image named `quarkus-quickstart/getting-started`.
ja_jp: xref:building-native-image.adoc[ネイティブイメージのビルドガイド] に従っていれば、 `quarkus-quickstart/getting-started` という名前のローカルコンテナーイメージがあるはずです。

source: If you create a bean of the following types in your application, it will automatically be injected into the `ValidatorFactory` configuration:
ja_jp: アプリケーションで以下のタイプのBeanを作成すると、自動的に `ValidatorFactory` の設定に注入されます。

source: If you create new projects with Java 25, the projects will fully target Java 25 by default.
ja_jp: Java 25で新しいプロジェクトを作成すると、プロジェクトはデフォルトでJava 25を完全にターゲットとします。

source: If you decide to follow the example from the Hibernate ORM guide to declare a custom CDI bean for the active persistence unit, but you use Hibernate Reactive, make sure to work with the `Mutiny.SessionFactory` type instead of `Session`: this is one way Hibernate Reactive's API entrypoint differs from Hibernate ORM's.
ja_jp: Hibernate ORM ガイドの例に従って、アクティブな永続化ユニットのカスタム CDI Bean を宣言し、Hibernate Reactive を使用する場合は、`Session` 型の代わりに `Mutiny.SessionFactory` 型を使用するようにしてください。これは、Hibernate Reactive の API エントリーポイントが Hibernate ORM と異なる点の1つです。

source: If you declare a *parameter declaration* in a template then Qute attempts to validate all expressions that reference this parameter and if an incorrect expression is found the build fails.
ja_jp: テンプレートで *パラメーター宣言* を宣言した場合、Quteはこのパラメーターを参照するすべての式の検証を試み、間違った式が見つかった場合はビルドが失敗します。

source: If you develop a xref:security-openid-connect-web-authentication.adoc[Quarkus OIDC web-app application] then you should set `quarkus.oidc.application-type=web-app` in `application.properties` before starting the application.
ja_jp: xref:security-openid-connect-web-authentication.adoc[Quarkus OIDC web-app アプリケーション] を開発する場合は、アプリケーションを開始する前に `application.properties` で `quarkus.oidc.application-type=web-app` を設定する必要があります。

source: If you did not leave Quarkus running in dev mode, start it again:
ja_jp: Quarkusを開発モードで起動したままにしていない場合は、再度起動してください:

source: If you did the Kafka quickstart, you have realized that it's the same code. The only difference is the connector configuration and the JSON mapping.
ja_jp: Kafka クイックスタートを実行した場合、それが同じコードであることに気づいたはずです。唯一の違いは、コネクター設定と JSON マッピングです。

source: If you did the Kafka, you have realized that it's the same code. The only difference is the connector configuration and the JSON mapping.
ja_jp: Kafkaをやった方は、同じコードであることに気づいたと思います。唯一の違いは、コネクタの設定とJSONのマッピングです。

source: If you disable automatic schema creation by setting `quarkus.hibernate-search-orm.schema-management.strategy` to `none`, you will have to create the schema manually at some point before your application starts persisting/updating entities and executing search requests.
ja_jp: `quarkus.hibernate-search-orm.schema-management.strategy` を `none` に設定してスキーマの自動作成を無効にした場合、アプリケーションがエンティティの永続化/更新や検索リクエストの実行を開始する前に、手動でスキーマを作成する必要があります。

source: If you disable automatic schema creation by setting `quarkus.hibernate-search-standalone.schema-management.strategy` to `none`, you will have to create the schema manually at some point before your application starts persisting/updating entities and executing search requests.
ja_jp: `quarkus.hibernate-search-standalone.schema-management.strategy` を `none` に設定してスキーマの自動作成を無効にした場合、 アプリケーションが、エンティティーの永続化/更新や検索リクエストの実行を開始する前に、 手動でスキーマを作成する必要があります。

source: If you disable proactive authentication then the authentication process will only be run when an identity is requested, either because there are security rules that requires the user to be authenticated, or due to programmatic access to the current identity.
ja_jp: プロアクティブ認証を無効にすると、認証プロセスは ID が要求されたときにのみ実行されます。これは、ユーザーを認証する必要があるセキュリティルールが存在するか、 現在の ID にプログラムによるアクセスがあるためです。

source: If you disable proactive authentication, the authentication process runs only when an identity is requested. An identity can be requested because of security rules that require the user to authenticate or because programmatic access to the current identity is required.
ja_jp: プロアクティブ認証を無効にすると、アイデンティティーが要求されたときにのみ、認証プロセスが実行されます。アイデンティティーが要求されるのは、ユーザーを認証する必要があるセキュリ ティルールールや、現在の アイデンティティーへのプログラムによるアクセスによってです。

source: If you disagree with the Vale results, add the yellow PR label `needs-vale-rule-tweak`.
ja_jp: Valeの結果に同意できない場合は、黄色のPRラベル `needs-vale-rule-tweak` を付けてください。

source: If you disagree with the Vale results, be sure to add the yellow PR label `needs-vale-rule-tweak`.
ja_jp: Valeの結果に同意できない場合は、必ず黄色のPRラベル `needs-vale-rule-tweak` を付けてください。

source: If you do decide to build against 3.28, add the following to the `pom.xml` of your runtime module:
ja_jp: 3.28 に対してビルドすることを選択した場合は、ランタイムモジュールの `pom.xml` に以下を追加してください。

source: If you do declare multiple persistence units, you will also configure Hibernate Search separately for each persistence unit.
ja_jp: 複数の永続化ユニットを宣言する場合は、それぞれの永続化ユニットに対して個別にHibernate Searchを設定することになります。

source: If you do not have SSH keys configured for the Git repository, when specifying the Git path, use the HTTPS URL instead of the SSH URL.
ja_jp: Git リポジトリに SSH 鍵を設定していない場合は、Git のパスを指定する際に SSH URL ではなく HTTPS URL を使ってください。

source: If you do not like the default endpoint location `/q/openapi`, you can change it by adding the following configuration to your `application.properties`:
ja_jp: あなたがデフォルトのエンドポイントの場所 `/q/openapi` を好きではない場合 , あなたの `application.properties` に次の設定を追加することで、場所を変更することができます .

source: If you do not need a rollback for one datasource to trigger a rollback for other datasources, consider splitting your code into multiple transactions. To do so, use xref:transaction.adoc#programmatic-approach[`QuarkusTransaction.requiringNew()`]/xref:transaction.adoc#declarative-approach[`@Transactional(REQUIRES_NEW)`] (preferably) or xref:transaction.adoc#legacy-api-approach[`UserTransaction`] (for more complex use cases).
ja_jp: 1 つのデータソースのロールバックによって他のデータソースのロールバックをトリガーする必要がない場合は、コードを複数のトランザクションに分割することを検討してください。 これを行うには、xref:transaction.adoc#programmatic-approach[`QuarkusTransaction.requiringNew()`]/xref:transaction.adoc#declarative-approach[`@Transactional(REQUIRES_NEW)`] (推奨) または xref:transaction.adoc#legacy-api-approach[`UserTransaction`] (より複雑なユースケースの場合) を使用します。

source: If you do not provide a value for this property, the application startup fails with `io.quarkus.runtime.configuration.ConfigurationException: Failed to load config value of type class java.lang.String for: greeting.messagee`.
ja_jp: このプロパティーに値を提供しない場合、アプリケーションの起動は `io.quarkus.runtime.configuration.ConfigurationException: Failed to load config value of type class java.lang.String for: greeting.messagee` で失敗します。

source: If you do not provide a value for this property, the application startup fails with `jakarta.enterprise.inject.spi.DeploymentException: No config value of type [class java.lang.String] exists for: greeting.message`.
ja_jp: このプロパティに値を指定しない場合、アプリケーションの起動は `jakarta.enterprise.inject.spi.DeploymentException: No config value of type [class java.lang.String] exists for: greeting.message` で失敗します。

source: If you do not provide a value for this property, the application startup fails with `javax.enterprise.inject.spi.DeploymentException: No config value of type [class java.lang.String] exists for: greeting.message`.
ja_jp: このプロパティーに値を指定しないと、アプリケーションの起動は `javax.enterprise.inject.spi.DeploymentException: No config value of type [class java.lang.String] exists for: greeting.message` エラーで失敗します。

source: If you do not specify the `quarkus.oidc-client-graphql.client-name` property, GraphQL clients will use the default OIDC client without an explicit name.
ja_jp: `quarkus.oidc-client-graphql.client-name` プロパティーを指定しない場合、GraphQL クライアントは明示的な名前なしでデフォルトの OIDC クライアントを使用します。

source: If you do not want to allow your users to use multiple browser tabs to authenticate, disable this by specifying `quarkus.oidc.authentication.allow-multiple-code-flows=false`. This action also ensures that the same state cookie name is created for every new user authentication.
ja_jp: ユーザーに対して、複数のブラウザータブを使用した認証を許可しない場合は、 `quarkus.oidc.authentication.allow-multiple-code-flows=false` を指定して無効にしてください。 このアクションにより、新しいユーザー認証ごとに同じ状態 Cookie 名が作成されます。

source: If you do not want to embed the content, you can use the `.doNotEmbed()` on the Page Builder, this will then open the link in a new tab.
ja_jp: コンテンツを埋め込みたくない場合は、ページビルダーの `.doNotEmbed()`、リンクを新しいタブで開くことができます。

source: If you do not want to have both a JDBC datasource and a reactive datasource created, use the following configuration.
ja_jp: JDBC データソースとリアクティブデータソースの両方を作成しない場合は、次の設定を使用します。

source: If you do not want to use the HTTP feature then you can simply run the `remote-dev` command without specifying the URL. In this mode the command will continuously rebuild the local application, so you can use an external tool such as odo or rsync to sync to the remote application.
ja_jp: HTTP 機能を使用したくない場合は、URL を指定せずに `remote-dev` コマンドを実行するだけです。このモードでは、コマンドはローカルアプリケーションを継続的に再構築するので、 odo や rsync のような外部ツールを使ってリモートアプリケーションに同期することができます。

source: If you do not want to use the TLS registry, you can configure the HTTP server directly.
ja_jp: TLS レジストリーを使用しない場合は、HTTP サーバーを直接設定できます。

source: If you do not want to use the mock event server, you can test your lambdas with SAM CLI.
ja_jp: 模擬イベントサーバーを使用しない場合は、SAM CLI を使用して Lambda をテストできます。

source: If you do wish to continue enforcing a GitHub access token `user:email` scope after migrating to Quarkus OIDC, you can do as follows.
ja_jp: Quarkus OIDC に移行した後も GitHub アクセストークンの `user:email` スコープを強制し続けたい場合は、次のように行うことができます。

source: If you do wish to customize which metrics to track, you should use the following properties:
ja_jp: 追跡するメトリクスをカスタマイズする場合は、次のプロパティーを使用する必要があります。

source: If you don't control that exception wrapper type, you can place the annotation on any class and specify the exception wrapper types it applies to as an annotation parameter:
ja_jp: その例外ラッパータイプを制御できない場合は、任意のクラスにアノテーションを配置し、アノテーションパラメーターとして適用される例外ラッパータイプを指定できます。

source: If you don't control that exception wrapper type, you can place the annotation on any class and specify the exception wrapper types it applies to as annotation parameter:
ja_jp: その例外ラッパータイプを制御しない場合は、任意のクラスにアノテーションを配置し、適用される例外ラッパータイプをアノテーションパラメーターとして指定できます。

source: If you don't depend on the JSON default, it's highly advisable to use `@Produces` and `@Consumes` annotations on your endpoints to specify the expected content types precisely. This helps reduce the number of Jakarta REST providers (essentially converters) included in the native executable.
ja_jp: JSON のデフォルトに依存しない場合は、エンドポイントで `@Produces` および `@Consumes` アノテーションを使用して、予想されるコンテンツタイプを正確に指定することを強く推奨します。 これにより、ネイティブ実行可能ファイルに含まれる Jakarta REST プロバイダー (基本的にはコンバーター) の数を減らすことができます。

source: If you don't enable auto-commit, using this strategy is still possible but will never commit the offsets. In other words, you would restart from the oldest stored records every time. While there are use cases for this, double-check that's what you want. In this case, enable this strategy with:
ja_jp: オートコミットを有効にしていない場合、この戦略を使用することは可能ですが、オフセットをコミットすることはありません。言い換えれば、保存されている最も古いレコードから毎回再起動することになります。これにはユースケースがありますが、あなたが望むものであることを再確認してください。当てはまる場合、以下のようにこのストラテジーを有効にします:

source: If you don't find a `BuildItem` for what you want to achieve, you can create your own implementation. Keep in mind that a `BuildItem` should be as fine-grained as possible, representing a specific part of the deployment. To create your `BuildItem` you can extend:
ja_jp: 実現したいことに対応する `BuildItem` が見つからない場合は、独自の実装を作成することができます。 `BuildItem` は、デプロイメントの特定の部分を表すもので、できるだけ細かいものでなければならないということを覚えておいてください。 `BuildItem` を作成する方法:

source: If you don't have a Redis service running locally, you can run Redis in a Docker container:
ja_jp: Redisのサービスをローカルで実行していない場合は、DockerコンテナでRedisを実行することができます。

source: If you don't have any manual instrumentation of your own, you are done!
ja_jp: 独自の手動計装がない場合は、これで完了です。

source: If you don't import data manually in the database, you don't need this: the mass indexer should then only be used when you change your indexing configuration (adding a new field, changing an analyzer's configuration...) and you want the new configuration to be applied to your existing data.
ja_jp: データベースにデータを手動でインポートしない場合、これは必要ありません。 大量インデクサーはインデックス設定を変更し (いくつかフィールドの追加、アナライザーの設定変更など)、新しい設定を既存データに適用する必要がある場合にのみ使用します。

source: If you don't include the `quarkus-vertx-core` extension (or any extension depending on it), Quarkus won't create the Vert.x instance.
ja_jp: `quarkus-vertx-core` エクステンション(またはそれに依存するエクステンション)を含まない場合、QuarkusはVert.xインスタンスを作成しません。

source: If you don't know the name of your local datacenter, this value can be found by running the following CQL query: `SELECT data_center FROM system.local`.
ja_jp: ローカルのデータセンターの名前がわからない場合は、以下の CQL クエリを実行することでこの値を見つけることができます : `SELECT data_center FROM system.local`

source: If you don't log in to Azure you won't be able to deploy.
ja_jp: Azureにログインしないとデプロイできません。

source: If you don't login to Azure you won't be able to deploy.
ja_jp: Azureにログインしないとデプロイできません。

source: If you don't need endpoints of each type, you can remove the corresponding extensions from your `pom.xml`.
ja_jp: 各タイプのエンドポイントが不要な場合は、対応するエクステンションを `pom.xml` から削除することができます。

source: If you don't need the call to be non-blocking, this is how you can retrieve the cache value in a blocking way.
ja_jp: 呼び出しをノンブロッキングにする必要がない場合は、このようにしてブロッキングしてキャッシュ値を取得することができます。

source: If you don't plan on using native executables, you can pass your way as in JDK mode, SSL is supported without further manipulations.
ja_jp: JDK モードでは特に変更しなくても SSL がサポートされているので、ネイティブ実行可能ファイルを使用する予定がない場合はパスできます。

source: If you don't rely on the JSON default, it is heavily recommended to annotate your endpoints with the `@Produces` and `@Consumes` annotations to define precisely the expected content-types. It will allow to narrow down the number of JAX-RS providers (which can be seen as converters) included in the native executable.
ja_jp: JSON のデフォルトに頼らない場合は、エンドポイントに `@Produces` や `@Consumes` のアノテーションを付けて、期待されるコンテンツタイプを正確に定義することを強くお勧めします。これにより、ネイティブ実行可能ファイルに含まれる JAX-RS プロバイダ (コンバータとみなすことができます) の数を絞り込むことができます。

source: If you don't rely on the JSON default, it is heavily recommended to annotate your endpoints with the `@Produces` and `@Consumes` annotations to define precisely the expected content-types. It will allow to narrow down the number of Jakarta REST providers (which can be seen as converters) included in the native executable.
ja_jp: JSONのデフォルトに依存しない場合は、エンドポイントに `@Produces` と `@Consumes` のアノテーションを付けて、期待されるcontent-typesを正確に定義することが強く推奨されています。これにより、ネイティブ実行可能ファイルに含まれる Jakarta REST プロバイダー（コンバーターと見なすことができます）の数を減らすことができます。

source: If you don't see the output you expect, use `--help` to verify that you are invoking the command with the right arguments.
ja_jp: 期待する出力が表示されない場合は、 `--help` を使用して、正しい引数を使用してコマンドを呼び出していることを確認してください。

source: If you don't specify the `quarkus.oidc-client-graphql.client-name` property, GraphQL clients will use the default OIDC client (without an explicit name).
ja_jp: `quarkus.oidc-client-graphql.client-name`プロパティーを指定しない場合は、 GraphQL クライアントは、デフォルトの OIDC クライアント (明示的な名前なし) を使用します。

source: If you don't use Undertow or https://jakarta.ee/specifications/websocket/[Jakarta WebSocket], it is recommended to use the more modern xref:websockets-next-tutorial.adoc[WebSockets Next extensions].
ja_jp: Undertow または https://jakarta.ee/specifications/websocket/[Jakarta WebSocket] を使用しない場合は、よりモダンな xref:websockets-next-tutorial.adoc[WebSockets Next extension] の使用をお勧めします。

source: If you don't use a `defaultValue`, and your property isn't defined in the application properties, we have a code action to auto-generate it as well.
ja_jp: `defaultValue` を使用せず、アプリケーションのプロパティでプロパティが定義されていない場合、同様に自動生成するコードアクションを用意しています。

source: If you don't want JSON by default you can set `quarkus.resteasy-json.default-json=false` and the default will change back to being auto-negotiated. If you set this you will need to add `@Produces(MediaType.APPLICATION_JSON)` and `@Consumes(MediaType.APPLICATION_JSON)` to your endpoints in order to use JSON.
ja_jp: デフォルトでJSONを使用したくない場合は、 `quarkus.resteasy-json.default-json=false` を設定すると、デフォルトは自動ネゴシエーションに戻ります。これを設定した場合、JSON を使用するためには `@Produces(MediaType.APPLICATION_JSON)` と `@Consumes(MediaType.APPLICATION_JSON)` をエンドポイントに追加する必要があります。

source: If you don't want all the hassle with Dev Services (e.g. lookup and re-use of existing running containers, etc) you can simply disable Dev Services and enable just Dev Resource usage:
ja_jp: Dev Services に関する面倒な作業 (既存の実行中のコンテナーの検索や再利用など) を避ける場合は、Dev Services を無効にして、Dev Resource の使用のみを有効にすることができます。

source: If you don't want any test output in the console and just want to interact through the Dev UI you can set `quarkus.test.console=false`.
ja_jp: コンソールでのテスト出力を必要とせず、開発者用のUIで対話したい場合は、 `quarkus.test.console=false` を設定します。

source: If you don't want to bother defining getters/setters for your entities, you can make them extend `PanacheEntityBase` and Quarkus will generate them for you. You can even extend `PanacheEntity` and take advantage of the default ID it provides.
ja_jp: エンティティにゲッター/セッターを定義するのが面倒な場合は、 `PanacheEntityBase` を拡張するようにすればQuarkusが生成してくれます。また、 `PanacheEntity` を拡張して、デフォルトのIDを利用することもできます。
